{
  "creatures": [
    {
      "id": "baba-yaga",
      "name": "Baba Yaga",
      "enrichedIntros": [
        "In a ring of birch, a hut breathes smoke and whispers. Chicken legs creak beneath warped wood. The witch waits, her mortar idle, her pestle gleaming. She offers riddles, not mercy.",
        "The forest parts. A hut stands on chicken legs, scratching at the earth. Baba Yaga peers from the window, her grin crooked and knowing. 'Come closer, traveler. Let's see if you're clever.'",
        "Bone-white birch trees circle the clearing. The hut spins slowly, its door facing you. Inside, the witch stirs her cauldron, humming riddles. Will you answer, or will you flee?"
      ],
      "coreMechanic": "riddle",
      "levels": [
        {
          "levelIndex": 0,
          "sceneText": "The witch's eyes gleam like amber coals.",
          "enrichedScene": "Amber light spills from the window slats. Runes carved in bone dangle from the eaves, spinning slow. Baba Yaga leans forward, her grin sharp as winter. 'Answer me this, traveler: I am the beginning of eternity, the end of time and space, the beginning of every end, and the end of every place. What am I?'",
          "choices": [
            {
              "text": "Answer: The letter E",
              "isCorrect": true,
              "consequence": "She cackles, delighted. 'Clever tongue! You see patterns where others see only words. Pass, then.'"
            },
            {
              "text": "Answer: Death",
              "isCorrect": false,
              "consequence": "The hut turns away. 'Too literal, too dull.' The forest swallows you whole."
            }
          ],
          "riddleData": {
            "riddle": "I am the beginning of eternity, the end of time and space, the beginning of every end, and the end of every place.",
            "hint": "It is a letter.",
            "answerKey": "letter E"
          }
        },
        {
          "levelIndex": 1,
          "sceneText": "The witch circles you, her pestle tapping the ground.",
          "enrichedScene": "Smoke curls from her pipe, thick and sweet. The hut's walls creak, listening. She taps her pestle once, twice, thrice. 'Another riddle, little mouse: I have no voice, yet I speak to you. I tell of all things in the world that people do. I have leaves, but I am not a tree. I have a spine, but no bones. What am I?'",
          "choices": [
            {
              "text": "Answer: A book",
              "isCorrect": true,
              "consequence": "Her cackle echoes through the birch trees. 'Wise indeed! You understand that knowledge has many forms. Proceed.'"
            },
            {
              "text": "Answer: The wind",
              "isCorrect": false,
              "consequence": "She waves her hand dismissively. 'Wind has no spine, fool.' You become a frog, forever croaking in her garden."
            }
          ],
          "riddleData": {
            "riddle": "I have no voice, yet I speak to you. I tell of all things in the world that people do. I have leaves, but I am not a tree. I have a spine, but no bones.",
            "hint": "You read it to gain knowledge.",
            "answerKey": "book"
          }
        },
        {
          "levelIndex": 2,
          "sceneText": "The witch offers one final test.",
          "enrichedScene": "The hut settles, its legs folding beneath. Baba Yaga's eyes soften, just a fraction. 'One last riddle, traveler. This one separates the clever from the wise: I am always hungry, I must always be fed. The finger I touch will soon turn red. What am I?'",
          "choices": [
            {
              "text": "Answer: Fire",
              "isCorrect": true,
              "consequence": "She smiles, a rare gift. 'Yes! Fire — destroyer and creator, like me. Go, blessed one. You understand the old ways.'"
            },
            {
              "text": "Answer: Time",
              "isCorrect": false,
              "consequence": "The hut's door slams shut. 'Time devours all, yes, but it does not burn. You are lost to the woods, another fool who thought too much.'"
            }
          ],
          "riddleData": {
            "riddle": "I am always hungry, I must always be fed. The finger I touch will soon turn red.",
            "hint": "It burns and needs fuel to survive.",
            "answerKey": "fire"
          }
        }
      ],
      "victoryTexts": [
        "The witch grants you passage. Her blessing burns warm in your chest, a gift of old magic. 'You have the wit of the ancients,' she says.",
        "Baba Yaga cackles with delight. 'Clever one! Go forth with my favor.' The forest opens before you, welcoming. The runes glow in approval.",
        "She nods, satisfied. 'You've earned your way, riddler.' Her magic settles on your shoulders like a cloak of stars. The hut bows as you leave."
      ],
      "defeatTexts": [
        "The forest swallows your path. Baba Yaga's laughter echoes through the birch trees, fading into mist. 'Another fool who couldn't see beyond the obvious.'",
        "The hut turns its back. You stumble through endless woods, lost forever. The witch's cackle follows you into darkness. 'Cleverness is not enough without wisdom.'",
        "She waves her pestle. The world tilts. You are something small now, scurrying through the underbrush, forgotten. The riddles echo in your tiny mind, forever unanswered."
      ]
    },
    {
      "id": "banshee",
      "name": "Banshee",
      "enrichedIntros": [
        "A keening cry splits the mist. She appears, pale as moonlight, her hair flowing like water. The Banshee mourns, and her sorrow drowns the living. Speak softly, or be lost to her wail.",
        "The mist thickens. A voice rises, elegiac and ancient. She drifts toward you, translucent and grieving. The Banshee remembers all who are forgotten. Will you listen to her lament?",
        "Cold wind carries her song. The Banshee materializes, eyes hollow with centuries of loss. Her sorrow is a tide that pulls the living under. Tread carefully, speak gently."
      ],
      "coreMechanic": "calmness",
      "levels": [
        {
          "levelIndex": 0,
          "sceneText": "The Banshee's eyes are hollow, filled with ancient grief.",
          "enrichedScene": "Pale blue mist coils around her form. Her voice rises and falls like waves against stone. She reaches toward you, fingers trembling. 'Do you hear them? The voices of the lost?' Her sorrow is overwhelming. What do you offer?",
          "choices": [
            {
              "text": "Offer silence and presence, listening to her pain",
              "isCorrect": true,
              "consequence": "Her wail softens. A tear falls, luminous and cold. 'You understand,' she whispers."
            },
            {
              "text": "Offer comfort, telling her the dead are at peace",
              "isCorrect": false,
              "consequence": "Her scream shatters your mind. 'You know nothing of their suffering!' You fall, never to rise."
            }
          ]
        },
        {
          "levelIndex": 1,
          "sceneText": "The Banshee drifts closer, her sorrow palpable.",
          "enrichedScene": "Echo-waves ripple from her form, each one carrying fragments of memory. She sings of loss, of names forgotten. The air grows cold. 'They told me to stop crying,' she whispers. 'They said to move on. But how can I forget?' Her eyes search yours.",
          "choices": [
            {
              "text": "Encourage her to let go and find peace",
              "isCorrect": false,
              "consequence": "Her wail pierces your heart. 'You're just like them!' You join the forgotten, another voice in her chorus."
            },
            {
              "text": "Tell her grief has no timeline, that remembering is sacred",
              "isCorrect": true,
              "consequence": "She smiles, faint as starlight. 'Thank you for not rushing me, kind soul.'"
            }
          ]
        },
        {
          "levelIndex": 2,
          "sceneText": "The Banshee's form begins to fade, but she hesitates.",
          "enrichedScene": "The mist thins. Her voice grows distant, elegiac and soft. She looks at you with eyes like deep water. 'If I stop mourning, will they truly be gone? If I let go of this pain, do I lose them forever?' Her question hangs in the air.",
          "choices": [
            {
              "text": "Assure her she must release the pain to be free",
              "isCorrect": false,
              "consequence": "She screams, 'You want me to forget them!' The world goes dark. You are lost, misunderstood like her."
            },
            {
              "text": "Tell her that love remains even when grief transforms",
              "isCorrect": true,
              "consequence": "She fades, peaceful at last. 'Yes... I can carry love instead of only sorrow.' Her song lives in you, gentle now."
            }
          ]
        }
      ],
      "victoryTexts": [
        "The Banshee fades into mist, her sorrow eased but not erased. You carry her song, a haunting melody of remembrance and love.",
        "She smiles, a ghost of warmth. 'You have given me permission to grieve and to heal.' Her form dissolves, leaving only echoes of gratitude.",
        "The wail softens to a lullaby. She fades, finally understanding. Her memory lives in you, gentle and eternal, grief transformed but not forgotten."
      ],
      "defeatTexts": [
        "Her wail consumes you. You become another voice in her eternal chorus, lost to the mist forever, another who didn't understand.",
        "The scream pierces your soul. You fall, joining the forgotten. The Banshee's sorrow claims another who tried to fix what shouldn't be fixed.",
        "Her cry shatters you. The mist closes in. You are lost now, a name she will sing in her endless lament, another who rushed her healing."
      ]
    },
    {
      "id": "aswang",
      "name": "Aswang",
      "enrichedIntros": [
        "In the village, lanterns flicker and die. Something moves in the shadows, wearing a familiar face. The Aswang hunts, patient and hungry. Watch closely. Trust nothing.",
        "Night falls on the village. Dogs bark warnings. A neighbor waves from the darkness, but their shadow falls wrong. The Aswang is here. Stay sharp, stay alive.",
        "The village sleeps uneasily. Lantern flames gutter and die. Something prowls between the houses, wearing stolen skin. The Aswang is hunting. Will you survive until dawn?"
      ],
      "coreMechanic": "deduction",
      "levels": [
        {
          "levelIndex": 0,
          "sceneText": "Something moves in the darkness, wearing a neighbor's face.",
          "enrichedScene": "Red-tinted fog creeps through the village streets. A figure approaches, familiar yet wrong. Their reflection in the puddle shows backwards. Dogs whimper and hide. You have items in your pocket: salt, a mirror, garlic, and a candle.",
          "choices": [
            {
              "text": "Scatter salt across the threshold",
              "isCorrect": true,
              "correctItem": "salt",
              "consequence": "The figure recoils, hissing. Salt burns paths — the first truth revealed."
            },
            {
              "text": "Invite them inside for shelter",
              "isCorrect": false,
              "consequence": "The door closes behind them. Too late, you see the tongue unfurl."
            }
          ]
        },
        {
          "levelIndex": 1,
          "sceneText": "The creature circles, its true nature flickering through.",
          "enrichedScene": "Shadows twist unnaturally. The Aswang's human mask slips — you glimpse leathery skin beneath. It moves closer, testing you. You clutch an ember from the dying fire and a small mirror. Which will reveal the truth?",
          "choices": [
            {
              "text": "Hold the ember up to its face",
              "isCorrect": true,
              "correctItem": "ember",
              "consequence": "The firelight reveals its true form — skin peeling, eyes glowing. Ember reveals truth."
            },
            {
              "text": "Show it the mirror to prove it's human",
              "isCorrect": false,
              "consequence": "It smiles at its backwards reflection. 'Clever,' it whispers, then strikes."
            }
          ]
        },
        {
          "levelIndex": 2,
          "sceneText": "The Aswang sheds its disguise, wings unfurling in the darkness.",
          "enrichedScene": "The creature stands revealed — leathery wings spread wide, tongue extending like a serpent. This is the moment. You know its stolen name. You have holy oil and a blade. The sequence matters: reveal, bind, speak. Choose the final step.",
          "choices": [
            {
              "text": "Speak its stolen name aloud",
              "isCorrect": true,
              "correctItem": "speak-name",
              "consequence": "The name pins it like a nail. It shrieks, bound by truth, and flees into the night."
            },
            {
              "text": "Strike with the blade first",
              "isCorrect": false,
              "consequence": "Too hasty. The blade passes through shadow. Its tongue finds your throat."
            }
          ]
        }
      ],
      "victoryTexts": [
        "The Aswang flees into the night, wounded and named. The village is safe. You followed the sequence: salt, ember, name. You are a hunter now.",
        "Your words bind it. The creature shrieks and vanishes into darkness. Dawn breaks. The village is saved, and you stand victorious, keeper of the old ways.",
        "It recoils from the spoken name, hissing in pain. The Aswang retreats, defeated. The roosters crow. You've survived the night, a guardian who knows the sequence."
      ],
      "defeatTexts": [
        "You chose wrong. The Aswang's hunger is satisfied. The village mourns another loss, never knowing the truth of your fate.",
        "The sequence broken, the creature strikes. Its tongue wraps around you. Darkness. The village wakes to find you gone, another mystery unsolved.",
        "You trusted the wrong tool. The Aswang feeds. By morning, you're just another disappearance, whispered about in fearful tones."
      ]
    }
  ]
}
